app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(school_class_params)
        # @school_class.title = params[:title]
        # @school_class.room_number = params[:room_number]
        @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]

    def update
        @school_class = SchoolClass.find(params[:id])
        # @school_class.update(params.require(:school_class).permit(:title, :room_number))
        @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]