app/controllers/students_controller.rb

    def create
        # @student = Student.new
        # @student.first_name = params[:first_name]
        # @student.last_name = params[:last_name]
        # @student.save
        @student = Student.new(student_params)
		@student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-09-03 18:27:49.239083"], ["updated_at", "2019-09-03 18:27:49.239083"]]

    def update
        @student = Student.find(params[:id])
        # @student.update(params.require(:student).permit(:first_name, :last_name))
		@student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-09-03 18:27:50.034107"], ["id", 1]]